Revit 2027 API
OptionalFunctionalityUtils.IsSTEPImportLinkAvailable Method
 Checks whether the STEP Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSTEPImportLinkAvailable()
Public Shared Function IsSTEPImportLinkAvailable As Boolean
public:
static bool IsSTEPImportLinkAvailable()
static member IsSTEPImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the STEP Import/Link functionality is available in the installed Revit.
Remarks
 STEP Import/Link is optional functionality that does not have to be a part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace